ACU-IOTrotarygarage/ESP32-Firmware/firmware/firmware_support/support_tasmota.ino
void IRAM_ATTR ZeroCrossIsr(void) {
  uint32_t time = micros();
  FirmwareGlobal.zc_interval = ((int32_t) (time - FirmwareGlobal.zc_time));
  FirmwareGlobal.zc_time = time;
}

void ZeroCrossInit(uint32_t offset) {
  if (PinUsed(GPIO_ZEROCROSS)) {
    FirmwareGlobal.zc_offset = offset;

    uint32_t gpio = Pin(GPIO_ZEROCROSS);
    pinMode(gpio, INPUT_PULLUP);
    attachInterrupt(gpio, ZeroCrossIsr, CHANGE);

    AddLog(LOG_LEVEL_INFO, PSTR("ZCD: Activated"));  // Zero-cross detection activated
  }
}

/********************************************************************************************/

void XdrvXsnsCall(uint32_t function) {
  XdrvCall(function);
  XsnsCall(function);
}

void XsnsXdrvCall(uint32_t function) {
  XsnsCall(function);
  XdrvCall(function);
}

void SetLatchingRelay(power_t lpower, uint32_t state) {
  // FirmwareGlobal.power xx00 - toggle REL1 (Off) and REL3 (Off) - device 1 Off, device 2 Off
  // FirmwareGlobal.power xx01 - toggle REL2 (On)  and REL3 (Off) - device 1 On,  device 2 Off
  // FirmwareGlobal.power xx10 - toggle REL1 (Off) and REL4 (On)  - device 1 Off, device 2 On
  // FirmwareGlobal.power xx11 - toggle REL2 (On)  and REL4 (On)  - device 1 On,  device 2 On
  static power_t latching_power = 0;     // Power state at latching start

  if (state && !FirmwareGlobal.latching_relay_pulse) {  // Set latching relay to power if previous pulse has finished
    latching_power = lpower;
    FirmwareGlobal.latching_relay_pulse = 2;            // max 200mS (initiated by stateloop())
  }

  for (uint32_t i = 0; i < FirmwareGlobal.devices_present; i++) {
    uint32_t port = (i << 1) + ((latching_power >> i) &1);
    DigitalWrite(GPIO_REL1, port, bitRead(FirmwareGlobal.rel_inverted, port) ? !state : state);
  }
}

void SetDevicePower(power_t rpower, uint32_t source) {
  if (FirmwareGlobal.power_on_delay) {
    FirmwareGlobal.power_on_delay_state = rpower;
    return;
  }

  ShowSource(source);
  FirmwareGlobal.last_source = source;

  if (POWER_ALL_ALWAYS_ON == Settings->poweronstate) {  // All on and stay on
    FirmwareGlobal.power = POWER_MASK >> (POWER_SIZE - FirmwareGlobal.devices_present);
    rpower = FirmwareGlobal.power;
  }

  if (Settings->flag.interlock) {          // Allow only one or no relay set - CMND_INTERLOCK - Enable/disable interlock
    for (uint32_t i = 0; i < MAX_INTERLOCKS; i++) {
      power_t mask = 1;
      uint32_t count = 0;
      for (uint32_t j = 0; j < FirmwareGlobal.devices_present; j++) {
        if ((Settings->interlock[i] & mask) && (rpower & mask)) {
          count++;
        }
        mask <<= 1;
      }
      if (count > 1) {
        mask = ~Settings->interlock[i];    // Turn interlocked group off as there would be multiple relays on
        FirmwareGlobal.power &= mask;
        rpower &= mask;
      }
    }
  }

  if (rpower) {                           // Any power set
    FirmwareGlobal.last_power = rpower;
  }

  XdrvMailbox.index = rpower;
  XdrvXsnsCall(FUNC_SET_POWER);           // Signal power state

  XdrvMailbox.index = rpower;
  XdrvMailbox.payload = source;
  if (XdrvCall(FUNC_SET_DEVICE_POWER)) {  // Set power state and stop if serviced
    // Serviced
  }
#ifdef ESP8266
  else if ((SONOFF_DUAL == FirmwareGlobal.module_type) || (CH4 == FirmwareGlobal.module_type)) {
    Serial.write(0xA0);
    Serial.write(0x04);
    Serial.write(rpower &0xFF);
    Serial.write(0xA1);
    Serial.write('\n');
    Serial.flush();
  }
  else if (EXS_RELAY == FirmwareGlobal.module_type) {
    SetLatchingRelay(rpower, 1);
  }
#endif  // ESP8266
  else {
    uint32_t port = 0;
    uint32_t port_next;

    ZeroCrossMomentStart();

    for (uint32_t i = 0; i < FirmwareGlobal.devices_present; i++) {
      power_t state = rpower &1;

      port_next = 1;                              // Select next relay
      if (bitRead(FirmwareGlobal.rel_bistable, port)) {
        if (!state) { port_next = 2; }            // Skip highest relay
        port += state;                            // Relay<lowest> = Off, Relay<highest> = On
        state = 1;                                // Set pulse
      }
      if (i < MAX_RELAYS) {
        DigitalWrite(GPIO_REL1, port, bitRead(FirmwareGlobal.rel_inverted, port) ? !state : state);
      }
      port += port_next;                          // Select next relay
      rpower >>= 1;                               // Select next power
    }

    ZeroCrossMomentEnd();

    // Reset bistable relay here to fix non-interlock situations due to fast switching
    if (FirmwareGlobal.rel_bistable) {             // If bistable relays in the mix reset them after 40ms
      delay(Settings->param[P_BISTABLE_PULSE]);   // SetOption45 - Keep energized for about 5 x operation time
      for (uint32_t i = 0; i < port; i++) {       // Reset up to detected amount of ports
        if (bitRead(FirmwareGlobal.rel_bistable, i)) {
          DigitalWrite(GPIO_REL1, i, bitRead(FirmwareGlobal.rel_inverted, i) ? 1 : 0);
        }
      }
    }
  }
}

void RestorePower(bool publish_power, uint32_t source)
{
  if (FirmwareGlobal.power != FirmwareGlobal.last_power) {
    FirmwareGlobal.power = FirmwareGlobal.last_power;
    SetDevicePower(FirmwareGlobal.power, source);
    if (publish_power) {
      MqttPublishAllPowerState();
    }
  }
}

void SetAllPower(uint32_t state, uint32_t source)
{
// state 0 = POWER_OFF = Relay Off
// state 1 = POWER_ON = Relay On (turn off after Settings->pulse_timer * 100 mSec if enabled)
// state 2 = POWER_TOGGLE = Toggle relay
// state 8 = POWER_OFF_NO_STATE = Relay Off and no publishPowerState
// state 9 = POWER_ON_NO_STATE = Relay On and no publishPowerState
// state 10 = POWER_TOGGLE_NO_STATE = Toggle relay and no publishPowerState
// state 16 = POWER_SHOW_STATE = Show power state

  bool publish_power = true;
  if ((state >= POWER_OFF_NO_STATE) && (state <= POWER_TOGGLE_NO_STATE)) {
    state &= 3;                           // POWER_OFF, POWER_ON or POWER_TOGGLE
    publish_power = false;
  }
  if ((state >= POWER_OFF) && (state <= POWER_TOGGLE)) {
    power_t all_on = POWER_MASK >> (POWER_SIZE - FirmwareGlobal.devices_present);
    switch (state) {
    case POWER_OFF:
      FirmwareGlobal.power = 0;
      break;
    case POWER_ON:
      FirmwareGlobal.power = all_on;
      break;
    case POWER_TOGGLE:
      FirmwareGlobal.power ^= all_on;      // Complement current state
    }
    SetDevicePower(FirmwareGlobal.power, source);
  }
  if (publish_power) {
    MqttPublishAllPowerState();
  }
}

void SetPowerOnState(void)
{
#ifdef ESP8266
  if (MOTOR == FirmwareGlobal.module_type) {
    Settings->poweronstate = POWER_ALL_ON;   // Needs always on else in limbo!
  }
#endif  // ESP8266
  if (POWER_ALL_ALWAYS_ON == Settings->poweronstate) {
    SetDevicePower(1, SRC_RESTART);
  } else {
    power_t devices_mask = POWER_MASK >> (POWER_SIZE - FirmwareGlobal.devices_present);
    if (ResetReasonPowerOn()) {
      switch (Settings->poweronstate) {
      case POWER_ALL_OFF:
      case POWER_ALL_OFF_PULSETIME_ON:
        FirmwareGlobal.power = 0;
        SetDevicePower(FirmwareGlobal.power, SRC_RESTART);
        break;
      case POWER_ALL_ON:  // All on
        FirmwareGlobal.power = devices_mask;
        SetDevicePower(FirmwareGlobal.power, SRC_RESTART);
        break;
      case POWER_ALL_SAVED_TOGGLE:
        FirmwareGlobal.power = (Settings->power & devices_mask) ^ POWER_MASK;
        if (Settings->flag.save_state) {  // SetOption0 - Save power state and use after restart
          SetDevicePower(FirmwareGlobal.power, SRC_RESTART);
        }
        break;
      case POWER_ALL_SAVED:
        FirmwareGlobal.power = Settings->power & devices_mask;
        if (Settings->flag.save_state) {  // SetOption0 - Save power state and use after restart
          SetDevicePower(FirmwareGlobal.power, SRC_RESTART);
        }
        break;
      }
    } else {
      FirmwareGlobal.power = Settings->power & devices_mask;
      if (Settings->flag.save_state) {    // SetOption0 - Save power state and use after restart
        SetDevicePower(FirmwareGlobal.power, SRC_RESTART);
      }
    }
  }

