ACU-IOTrotarygarage/ESP32-Firmware/firmware/firmware_support/support_tasmota.ino
//  AddLog(LOG_LEVEL_DEBUG, PSTR("PWR: PowerOnState %d restored"), Settings->poweronstate);

  // Issue #526 and #909
  uint32_t port = 0;
  for (uint32_t i = 0; i < FirmwareGlobal.devices_present; i++) {
#ifdef ESP8266
    if (!Settings->flag3.no_power_feedback &&  // SetOption63 - Don't scan relay power state at restart - #5594 and #5663
        !FirmwareGlobal.power_on_delay) {       // SetOption47 - Delay switching relays to reduce power surge at power on
      if ((port < MAX_RELAYS) && PinUsed(GPIO_REL1, port)) {
        if (bitRead(FirmwareGlobal.rel_bistable, port)) {
          port++;                              // Skip both bistable relays as always 0
        } else {
          bitWrite(FirmwareGlobal.power, i, digitalRead(Pin(GPIO_REL1, port)) ^ bitRead(FirmwareGlobal.rel_inverted, port));
        }
      }
      port++;
    }
#endif  // ESP8266
    if (bitRead(FirmwareGlobal.power, i) || (POWER_ALL_OFF_PULSETIME_ON == Settings->poweronstate)) {
      SetPulseTimer(i % MAX_PULSETIMERS, Settings->pulse_timer[i % MAX_PULSETIMERS]);
    }
  }

  FirmwareGlobal.blink_powersave = FirmwareGlobal.power;
#ifdef USE_RULES
  RulesEvery50ms();
#endif
}

void UpdateLedPowerAll()
{
	for (uint32_t i = 0; i < FirmwareGlobal.leds_present; i++) {
		SetLedPowerIdx(i, bitRead(FirmwareGlobal.led_power, i));
	}
}

void SetLedPowerIdx(uint32_t led, uint32_t state)
{
/*
  // Fix legacy led support 20211016 (Notice: legacy led supports TWO leds max)
  if (!PinUsed(GPIO_LEDLNK) && (0 == led)) {  // Legacy - LED1 is link led only if LED2 is present
    if (PinUsed(GPIO_LED1, 1)) {
      led = 1;
    }
  }
*/
  if (PinUsed(GPIO_LED1, led)) {
    uint32_t mask = 1 << led;
    if (state) {
      state = 1;
      FirmwareGlobal.led_power |= mask;
    } else {
      FirmwareGlobal.led_power &= (0xFF ^ mask);
    }
    uint16_t pwm = 0;
    if (bitRead(Settings->ledpwm_mask, led)) {
#ifdef USE_LIGHT
      pwm = changeUIntScale(ledGamma10(state ? Settings->ledpwm_on : Settings->ledpwm_off), 0, 1023, 0, Settings->pwm_range); // gamma corrected
#else //USE_LIGHT
      pwm = changeUIntScale((uint16_t)(state ? Settings->ledpwm_on : Settings->ledpwm_off), 0, 255, 0, Settings->pwm_range); // linear
#endif //USE_LIGHT
#ifdef ESP32
      if (analogAttach(Pin(GPIO_LED1, led)) >= 0)
#endif
        analogWrite(Pin(GPIO_LED1, led), bitRead(FirmwareGlobal.led_inverted, led) ? Settings->pwm_range - pwm : pwm);
    } else {
      DigitalWrite(GPIO_LED1, led, bitRead(FirmwareGlobal.led_inverted, led) ? !state : state);
    }
  }
#ifdef USE_BUZZER
  if (led == 0) {
    BuzzerSetStateToLed(state);
  }
#endif // USE_BUZZER
}

void SetLedPower(bool state)
{
  if (!PinUsed(GPIO_LEDLNK)) {           // Legacy - Only use LED1 and/or LED2
/*
    SetLedPowerIdx(0, state);
*/
    // Fix legacy led support 20211016 (Notice: legacy led supports TWO leds max)
    uint32_t led = (PinUsed(GPIO_LED1, 1)) ? 1 : 0;
    SetLedPowerIdx(led, state);
  } else {
    power_t mask = 1;
    for (uint32_t i = 0; i < FirmwareGlobal.leds_present; i++) {  // Map leds to power
      bool tstate = (FirmwareGlobal.power & mask);
      SetLedPowerIdx(i, tstate);
      mask <<= 1;
    }
  }
}

void SetLedPowerAll(uint32_t state)
{
  for (uint32_t i = 0; i < FirmwareGlobal.leds_present; i++) {
    SetLedPowerIdx(i, state);
  }
}

void SetLedLink(uint32_t state) {
#ifdef ESP32
  uint32_t index = XdrvMailbox.index;
  XdrvMailbox.index = state;
  XdrvCall(FUNC_LED_LINK);
  XdrvMailbox.index = index;
#endif  // ESP32
  int led_pin = Pin(GPIO_LEDLNK);
  uint32_t led_inv = FirmwareGlobal.ledlnk_inverted;
  if (-1 == led_pin) {                    // Legacy - LED1 is status
    SetLedPowerIdx(0, state);
  }
  else if (led_pin >= 0) {
    if (state) { state = 1; }
    digitalWrite(led_pin, (led_inv) ? !state : state);
  }
#ifdef USE_BUZZER
  BuzzerSetStateToLed(state);
#endif // USE_BUZZER
#ifdef USE_PWM_DIMMER
  if (Settings->flag4.powered_off_led) FirmwareGlobal.restore_powered_off_led_counter = 3;
#endif  // USE_PWM_DIMMER
}

void DebugLed(uint32_t mode) {
  static bool toggle = false;

  if (PinUsed(GPIO_LEDLNK)) {
    if (2 == mode) {
      toggle != toggle;
      mode = toggle;
    }
    digitalWrite(Pin(GPIO_LEDLNK), (FirmwareGlobal.ledlnk_inverted) ? !mode : mode);
  }
}

void SetPulseTimer(uint32_t index, uint32_t time)
{
  FirmwareGlobal.pulse_timer[index] = (time > 111) ? millis() + (1000 * (time - 100)) : (time > 0) ? millis() + (100 * time) : 0L;
}

uint32_t GetPulseTimer(uint32_t index)
{
  long time = TimePassedSince(FirmwareGlobal.pulse_timer[index]);
  if (time < 0) {
    time *= -1;
    return (time > 11100) ? (time / 1000) + 100 : (time > 0) ? time / 100 : 0;
  }
  return 0;
}

/********************************************************************************************/

bool SendKey(uint32_t key, uint32_t device, uint32_t state)
{
// key 0 = KEY_BUTTON = button_topic
// key 1 = KEY_SWITCH = switch_topic
// state 0 = POWER_OFF = off
// state 1 = POWER_ON = on
// state 2 = POWER_TOGGLE = toggle
// state 3 = POWER_HOLD = hold
// state 4 = POWER_INCREMENT = button still pressed
// state 5 = POWER_INV = button released
// state 6 = POWER_CLEAR = button released
// state 7 = POWER_RELEASE = button released
// state 9 = CLEAR_RETAIN = clear retain flag
// state 10 = POWER_DELAYED = button released delayed

  char stopic[TOPSZ];
  char scommand[CMDSZ];
  char key_topic[TOPSZ];
  bool result = false;
  uint32_t device_save = device;

  char *tmp = (key) ? SettingsText(SET_MQTT_SWITCH_TOPIC) : SettingsText(SET_MQTT_BUTTON_TOPIC);
  Format(key_topic, tmp, sizeof(key_topic));
  if (Settings->flag.mqtt_enabled && MqttIsConnected() && (strlen(key_topic) != 0) && strcmp(key_topic, "0")) {  // SetOption3 - Enable MQTT
    if (!key && (device > FirmwareGlobal.devices_present)) {
      device = 1;                  // Only allow number of buttons up to number of devices
    }
    GetTopic_P(stopic, CMND, key_topic,
               GetPowerDevice(scommand, device, sizeof(scommand), (key + Settings->flag.device_index_enable)));  // cmnd/switchtopic/POWERx - SetOption26 - Switch between POWER or POWER1
    if (CLEAR_RETAIN == state) {
      ResponseClear();
    } else {
      if ((Settings->flag3.button_switch_force_local ||      // SetOption61 - Force local operation when button/switch topic is set
           !strcmp(FirmwareGlobal.mqtt_topic, key_topic) ||
           !strcmp(SettingsText(SET_MQTT_GRP_TOPIC), key_topic)) &&
          (POWER_TOGGLE == state)) {
        state = ~(FirmwareGlobal.power >> (device -1)) &1;   // POWER_OFF or POWER_ON
      }
      Response_P(GetStateText(state));
    }
#ifdef USE_DOMOTICZ
    if (!(DomoticzSendKey(key, device, state, ResponseLength()))) {
#endif  // USE_DOMOTICZ
      MqttPublish(stopic, ((key) ? Settings->flag.mqtt_switch_retain                         // CMND_SWITCHRETAIN
                                 : Settings->flag.mqtt_button_retain) &&                     // CMND_BUTTONRETAIN
                                 (state != POWER_HOLD || !Settings->flag3.no_hold_retain));  // SetOption62 - Don't use retain flag on HOLD messages
#ifdef USE_DOMOTICZ
    }
#endif  // USE_DOMOTICZ
    result = !Settings->flag3.button_switch_force_local;  // SetOption61 - Force local operation when button/switch topic is set
  } else {
    Response_P(PSTR("{\"%s%d\":{\"State\":%d}}"), (key) ? PSTR("Switch") : PSTR("Button"), device, state);
    result = XdrvRulesProcess(0);
  }
#ifdef USE_PWM_DIMMER
  if (PWM_DIMMER != FirmwareGlobal.module_type || (!result && !Settings->flag3.mqtt_buttons)) {
#endif  // USE_PWM_DIMMER
  int32_t payload_save = XdrvMailbox.payload;
  XdrvMailbox.payload = device_save << 24 | key << 16 | state << 8 | device;
  XdrvCall(FUNC_ANY_KEY);
  XdrvMailbox.payload = payload_save;
#ifdef USE_PWM_DIMMER
    if (PWM_DIMMER == FirmwareGlobal.module_type) result = true;
  }
#endif  // USE_PWM_DIMMER
  return result;
}

void ExecuteCommandPower(uint32_t device, uint32_t state, uint32_t source)
{
// device  = Relay number 1 and up
// state 0 = POWER_OFF = Relay Off
// state 1 = POWER_ON = Relay On (turn off after Settings->pulse_timer * 100 mSec if enabled)
// state 2 = POWER_TOGGLE = Toggle relay
// state 3 = POWER_BLINK = Blink relay
// state 4 = POWER_BLINK_STOP = Stop blinking relay
// state 8 = POWER_OFF_NO_STATE = Relay Off and no publishPowerState
// state 9 = POWER_ON_NO_STATE = Relay On and no publishPowerState
// state 10 = POWER_TOGGLE_NO_STATE = Toggle relay and no publishPowerState
// state 16 = POWER_SHOW_STATE = Show power state

//  ShowSource(source);

//  if (1049 == LANGUAGE_LCID) { return; }

