ACU-IOTrotarygarage/ESP32-Firmware/firmware/firmware_support/support_tasmota.ino
#ifdef USE_SONOFF_IFAN
  if (IsModuleIfan()) {
    FirmwareGlobal.blink_mask &= 1;   // No blinking on the fan relays
    Settings->flag.interlock = 0;     // No interlock mode as it is already done by the microcontroller - CMND_INTERLOCK - Enable/disable interlock
    Settings->pulse_timer[1] = 0;     // No pulsetimers on the fan relays
    Settings->pulse_timer[2] = 0;
    Settings->pulse_timer[3] = 0;
  }
#endif  // USE_SONOFF_IFAN

  bool publish_power = true;
  if ((state >= POWER_OFF_NO_STATE) && (state <= POWER_TOGGLE_NO_STATE)) {
    state &= 3;                      // POWER_OFF, POWER_ON or POWER_TOGGLE
    publish_power = false;
  }

  if ((device < 1) || (device > FirmwareGlobal.devices_present)) {
    device = 1;
  }
  FirmwareGlobal.active_device = device;

  if (state != POWER_SHOW_STATE) {
    SetPulseTimer((device -1) % MAX_PULSETIMERS, 0);
  }

  static bool interlock_mutex = false;    // Interlock power command pending
  power_t mask = 1 << (device -1);        // Device to control
  if (state <= POWER_TOGGLE) {
    if ((FirmwareGlobal.blink_mask & mask)) {
      FirmwareGlobal.blink_mask &= (POWER_MASK ^ mask);  // Clear device mask
      MqttPublishPowerBlinkState(device);
    }

    if (Settings->flag.interlock &&        // CMND_INTERLOCK - Enable/disable interlock
        !interlock_mutex &&
        ((POWER_ON == state) || ((POWER_TOGGLE == state) && !(FirmwareGlobal.power & mask)))
       ) {
      interlock_mutex = true;                           // Clear all but masked relay in interlock group if new set requested
      bool perform_interlock_delay = false;
      for (uint32_t i = 0; i < MAX_INTERLOCKS; i++) {
        if (Settings->interlock[i] & mask) {             // Find interlock group
          for (uint32_t j = 0; j < FirmwareGlobal.devices_present; j++) {
            power_t imask = 1 << j;
            if ((Settings->interlock[i] & imask) && (FirmwareGlobal.power & imask) && (mask != imask)) {
              ExecuteCommandPower(j +1, POWER_OFF, SRC_IGNORE);
              perform_interlock_delay = true;
            }
          }
          break;                                        // An interlocked relay is only present in one group so quit
        }
      }
      if (perform_interlock_delay) {
        delay(50);                                // Add some delay to make sure never have more than one relay on
      }
      interlock_mutex = false;
    }

#ifdef USE_DEVICE_GROUPS
    power_t old_power = FirmwareGlobal.power;
#endif  // USE_DEVICE_GROUPS
    switch (state) {
    case POWER_OFF: {
      FirmwareGlobal.power &= (POWER_MASK ^ mask);
      break; }
    case POWER_ON:
      FirmwareGlobal.power |= mask;
      break;
    case POWER_TOGGLE:
      FirmwareGlobal.power ^= mask;
    }
#ifdef USE_DEVICE_GROUPS
    if (FirmwareGlobal.power != old_power && SRC_REMOTE != source && SRC_RETRY != source) {
      power_t dgr_power = FirmwareGlobal.power;
      if (Settings->flag4.multiple_device_groups) {  // SetOption88 - Enable relays in separate device groups
        dgr_power = (dgr_power >> (device - 1)) & 1;
      }
      SendDeviceGroupMessage(device, DGR_MSGTYP_UPDATE, DGR_ITEM_POWER, dgr_power);
    }
#endif  // USE_DEVICE_GROUPS
    SetDevicePower(FirmwareGlobal.power, source);
#ifdef USE_DOMOTICZ
    DomoticzUpdatePowerState(device);
#endif  // USE_DOMOTICZ
#ifdef USE_KNX
    KnxUpdatePowerState(device, FirmwareGlobal.power);
#endif  // USE_KNX
    if (publish_power && Settings->flag3.hass_tele_on_power) {  // SetOption59 - Send tele/%topic%/STATE in addition to stat/%topic%/RESULT
      MqttPublishTeleState();
    }

    // Restart PulseTime if powered On
    SetPulseTimer((device -1) % MAX_PULSETIMERS, (((POWER_ALL_OFF_PULSETIME_ON == Settings->poweronstate) ? ~FirmwareGlobal.power : FirmwareGlobal.power) & mask) ? Settings->pulse_timer[(device -1) % MAX_PULSETIMERS] : 0);
  }
  else if (POWER_BLINK == state) {
    if (!(FirmwareGlobal.blink_mask & mask)) {
      FirmwareGlobal.blink_powersave = (FirmwareGlobal.blink_powersave & (POWER_MASK ^ mask)) | (FirmwareGlobal.power & mask);  // Save state
      FirmwareGlobal.blink_power = (FirmwareGlobal.power >> (device -1))&1;  // Prep to Toggle
    }
    FirmwareGlobal.blink_timer = millis() + 100;
    FirmwareGlobal.blink_counter = ((!Settings->blinkcount) ? 64000 : (Settings->blinkcount *2)) +1;
    FirmwareGlobal.blink_mask |= mask;  // Set device mask
    MqttPublishPowerBlinkState(device);
    return;
  }
  else if (POWER_BLINK_STOP == state) {
    bool flag = (FirmwareGlobal.blink_mask & mask);
    FirmwareGlobal.blink_mask &= (POWER_MASK ^ mask);  // Clear device mask
    MqttPublishPowerBlinkState(device);
    if (flag) {
      ExecuteCommandPower(device, (FirmwareGlobal.blink_powersave >> (device -1))&1, SRC_IGNORE);  // Restore state
    }
    return;
  }
  if (publish_power) {
    MqttPublishPowerState(device);
  }
}

void StopAllPowerBlink(void)
{
  power_t mask;

  for (uint32_t i = 1; i <= FirmwareGlobal.devices_present; i++) {
    mask = 1 << (i -1);
    if (FirmwareGlobal.blink_mask & mask) {
      FirmwareGlobal.blink_mask &= (POWER_MASK ^ mask);  // Clear device mask
      MqttPublishPowerBlinkState(i);
      ExecuteCommandPower(i, (FirmwareGlobal.blink_powersave >> (i -1))&1, SRC_IGNORE);  // Restore state
    }
  }
}

void MqttShowState(void)
{
  char stemp1[TOPSZ];

  ResponseAppendTime();
  ResponseAppend_P(PSTR(",\"" D_JSON_UPTIME "\":\"%s\",\"UptimeSec\":%u"), GetUptime().c_str(), UpTime());

#ifdef ESP8266
#ifdef USE_ADC_VCC
  dtostrfd((double)ESP.getVcc()/1000, 3, stemp1);
  ResponseAppend_P(PSTR(",\"" D_JSON_VCC "\":%s"), stemp1);
#endif  // USE_ADC_VCC
#endif  // ESP8266

  ResponseAppend_P(PSTR(",\"" D_JSON_HEAPSIZE "\":%d,\"SleepMode\":\"%s\",\"Sleep\":%u,\"LoadAvg\":%u,\"MqttCount\":%u"),
    ESP_getFreeHeap1024(), GetTextIndexed(stemp1, sizeof(stemp1), Settings->flag3.sleep_normal, kSleepMode),  // SetOption60 - Enable normal sleep instead of dynamic sleep
    FirmwareGlobal.sleep, FirmwareGlobal.loop_load_avg, MqttConnectCount());

