ACU-IOTrotarygarage/ESP32-Firmware/firmware/firmware_support/support_tasmota.ino
#ifdef USE_BERRY
    extern void BrShowState(void);
    BrShowState();
#endif // USE_BERRY

  for (uint32_t i = 1; i <= FirmwareGlobal.devices_present; i++) {
#ifdef USE_LIGHT
    if ((LightDevice()) && (i >= LightDevice())) {
      if (i == LightDevice())  { ResponseLightState(1); }    // call it only once
    } else {
#endif
      ResponseAppend_P(PSTR(",\"%s\":\"%s\""), GetPowerDevice(stemp1, i, sizeof(stemp1), Settings->flag.device_index_enable),  // SetOption26 - Switch between POWER or POWER1
                                               GetStateText(bitRead(FirmwareGlobal.power, i-1)));
#ifdef USE_SONOFF_IFAN
      if (IsModuleIfan()) {
        ResponseAppend_P(PSTR(",\"" D_CMND_FANSPEED "\":%d"), GetFanspeed());
        break;
      }
#endif  // USE_SONOFF_IFAN
#ifdef USE_LIGHT
    }
#endif
  }

  if (FirmwareGlobal.pwm_present) {
    ResponseAppend_P(PSTR(","));
    MqttShowPWMState();
  }

  if (!FirmwareGlobal.global_state.wifi_down) {
    int32_t rssi = WiFi.RSSI();
    ResponseAppend_P(PSTR(",\"" D_JSON_WIFI "\":{\"" D_JSON_AP "\":%d,\"" D_JSON_SSID "\":\"%s\",\"" D_JSON_BSSID "\":\"%s\",\"" D_JSON_CHANNEL "\":%d,\"" D_JSON_WIFI_MODE "\":\"11%c\",\"" D_JSON_RSSI "\":%d,\"" D_JSON_SIGNAL "\":%d,\"" D_JSON_LINK_COUNT "\":%d,\"" D_JSON_DOWNTIME "\":\"%s\"}"),
      Settings->sta_active +1, EscapeJSONString(SettingsText(SET_STASSID1 + Settings->sta_active)).c_str(), WiFi.BSSIDstr().c_str(), WiFi.channel(),
      pgm_read_byte(&kWifiPhyMode[WiFi.getPhyMode() & 0x3]), WifiGetRssiAsQuality(rssi), rssi,
      WifiLinkCount(), WifiDowntime().c_str());
  }

  ResponseJsonEnd();
}

void MqttPublishTeleState(void)
{
  ResponseClear();
  MqttShowState();
  MqttPublishPrefixTopic_P(TELE, PSTR(D_RSLT_STATE), Settings->flag5.mqtt_state_retain);
  XdrvRulesProcess(1);
}

void TempHumDewShow(bool json, bool pass_on, const char *types, float f_temperature, float f_humidity)
{
  if (json) {
    ResponseAppend_P(PSTR(",\"%s\":{"), types);
    ResponseAppendTHD(f_temperature, f_humidity);
    ResponseJsonEnd();
#ifdef USE_DOMOTICZ
    if (pass_on) {
      DomoticzTempHumPressureSensor(f_temperature, f_humidity);
    }
#endif  // USE_DOMOTICZ
#ifdef USE_KNX
    if (pass_on) {
      KnxSensor(KNX_TEMPERATURE, f_temperature);
      KnxSensor(KNX_HUMIDITY, f_humidity);
    }
#endif  // USE_KNX
#ifdef USE_WEBSERVER
  } else {
    WSContentSend_THD(types, f_temperature, f_humidity);
#endif  // USE_WEBSERVER
  }
}

String GetSwitchText(uint32_t i) {
  String switch_text = "";
  if (i < MAX_SWITCHES_TXT) {
    switch_text = SettingsText(SET_SWITCH_TXT1 + i);
  }
  if ('\0' == switch_text[0]) {
    switch_text = F(D_JSON_SWITCH);
    switch_text += String(i+1);
  }
  return switch_text;
}

const char kGlobalValues[] PROGMEM = D_JSON_TEMPERATURE "|" D_JSON_HUMIDITY "|" D_JSON_PRESSURE;

void GetSensorValues(void) {
  char *start = ResponseData();
  int data_start = ResponseLength();

  XsnsXdrvCall(FUNC_JSON_APPEND);

  if (data_start == ResponseLength()) { return; }

  for (uint32_t type = 0; type < 3; type++) {
    if (!Settings->global_sensor_index[type] || FirmwareGlobal.user_globals[type]) { continue; }

    char key[20];
    GetTextIndexed(key, sizeof(key), type, kGlobalValues);

    float value = -9999;
    uint32_t idx = 0;
//    char *data = ResponseData();
    char *data = start;  // Invalid JSON ,"HTU21":{"Temperature":30.7,"Humidity":39.0,"DewPoint":15.2},"BME680":{"Temperature":30.0,"Humidity":50.4,"DewPoint":18.5,"Pressure":1009.6,"Gas":1660.52},"ESP32":{"Temperature":53.3}
    while (data) {
      data = strstr(data, key);
      if (data) {
        idx++;
        data += strlen(key) + 2;
        float new_value = CharToFloat(data);
        if (1 == idx) { value = new_value; }

//        AddLog(LOG_LEVEL_DEBUG, PSTR("DBG: %s value%d = %2_f"), key, idx, &new_value);

        if (idx == Settings->global_sensor_index[type]) {
          value = new_value;
          break;
        }
      }
    }
    if (value != -9999) {
      switch (type) {
        case 0:  // Temperature
          FirmwareGlobal.temperature_celsius = ConvertTempToCelsius(value);
          break;
        case 1:  // Humidity
          FirmwareGlobal.humidity = value;
          break;
        case 2:  // Pressure
          FirmwareGlobal.pressure_hpa = ConvertHgToHpa(value);
          break;
      }
      FirmwareGlobal.global_update = FirmwareGlobal.uptime;
    }
  }
}

void MqttAppendSensorUnits(void)
{
  if (ResponseContains_P(PSTR(D_JSON_PRESSURE))) {
    ResponseAppend_P(PSTR(",\"" D_JSON_PRESSURE_UNIT "\":\"%s\""), PressureUnit().c_str());
  }
  if (ResponseContains_P(PSTR(D_JSON_TEMPERATURE))) {
    ResponseAppend_P(PSTR(",\"" D_JSON_TEMPERATURE_UNIT "\":\"%c\""), TempUnit());
  }
  if (ResponseContains_P(PSTR(D_JSON_SPEED)) && Settings->flag2.speed_conversion) {
    ResponseAppend_P(PSTR(",\"" D_JSON_SPEED_UNIT "\":\"%s\""), SpeedUnit().c_str());
  }
}

bool MqttShowSensor(bool call_show_sensor) {
  ResponseAppendTime();

  int json_data_start = ResponseLength();
  for (uint32_t i = 0; i < MAX_SWITCHES_SET; i++) {
    if (SwitchUsed(i)) {
      ResponseAppend_P(PSTR(",\"%s\":\"%s\""), GetSwitchText(i).c_str(), GetStateText(SwitchState(i)));
    }
  }

  GetSensorValues();

  if (FirmwareGlobal.global_update && Settings->flag.mqtt_add_global_info) {  // SetOption2 (MQTT) Add global temperature/humidity/pressure info to JSON sensor message
    if ((FirmwareGlobal.humidity > 0) || !isnan(FirmwareGlobal.temperature_celsius) || (FirmwareGlobal.pressure_hpa != 0)) {
      uint32_t add_comma = 0;
      ResponseAppend_P(PSTR(",\"Global\":{"));
      if (!isnan(FirmwareGlobal.temperature_celsius)) {
        float t = ConvertTempToFahrenheit(FirmwareGlobal.temperature_celsius);
        ResponseAppend_P(PSTR("\"" D_JSON_TEMPERATURE "\":%*_f"),
          Settings->flag2.temperature_resolution, &t);
        add_comma++;
      }
      if (FirmwareGlobal.humidity > 0) {
        ResponseAppend_P(PSTR("%s\"" D_JSON_HUMIDITY "\":%*_f"),
          (add_comma)?",":"", Settings->flag2.humidity_resolution, &FirmwareGlobal.humidity);
        add_comma++;
      }
      if (2 == add_comma) {
        float dewpoint = CalcTempHumToDew(FirmwareGlobal.temperature_celsius, FirmwareGlobal.humidity);
        ResponseAppend_P(PSTR("%s\"" D_JSON_DEWPOINT "\":%*_f"),
          (add_comma)?",":"", Settings->flag2.temperature_resolution, &dewpoint);
      }
      if (FirmwareGlobal.pressure_hpa != 0) {
        float p = ConvertPressure(FirmwareGlobal.pressure_hpa);
        float s = ConvertPressureForSeaLevel(FirmwareGlobal.pressure_hpa);
        ResponseAppend_P(PSTR("%s\"" D_JSON_PRESSURE "\":%*_f,\"" D_JSON_PRESSUREATSEALEVEL "\":%*_f"),
          (add_comma)?",":"", Settings->flag2.pressure_resolution, &p, Settings->flag2.pressure_resolution, &s);
      }
      ResponseJsonEnd();
    }
  }

  bool json_data_available = (ResponseLength() - json_data_start);
  MqttAppendSensorUnits();
  ResponseJsonEnd();

