ACU-IOTrotarygarage/ESP32-Firmware/firmware/firmware_support/support_tasmota.ino
  if (call_show_sensor && json_data_available) { XdrvCall(FUNC_SHOW_SENSOR); }
  return json_data_available;
}

void MqttPublishSensor(void) {
  ResponseClear();
  if (MqttShowSensor(true)) {
    MqttPublishTeleSensor();
  }
}

void MqttPublishTeleperiodSensor(void) {
  ResponseClear();
  if (MqttShowSensor(true)) {
    MqttPublishPrefixTopic_P(TELE, PSTR(D_RSLT_SENSOR), Settings->flag.mqtt_sensor_retain);  // CMND_SENSORRETAIN
    XdrvRulesProcess(1);
  }
}

/*********************************************************************************************\
 * State loops
\*********************************************************************************************/
/*-------------------------------------------------------------------------------------------*\
 * Every second
\*-------------------------------------------------------------------------------------------*/

void PerformEverySecond(void)
{
  FirmwareGlobal.uptime++;

  if (POWER_CYCLE_TIME == FirmwareGlobal.uptime) {
    UpdateQuickPowerCycle(false);
  }

  if (BOOT_LOOP_TIME == FirmwareGlobal.uptime) {
    RtcRebootReset();

    Settings->last_module = Settings->module;

#ifdef USE_DEEPSLEEP
    if (!(DeepSleepEnabled() && !Settings->flag3.bootcount_update)) {  // SetOption76  - (Deepsleep) Enable incrementing bootcount (1) when deepsleep is enabled
#endif
      Settings->bootcount++;              // Moved to here to stop flash writes during start-up
      AddLog(LOG_LEVEL_DEBUG, PSTR(D_LOG_APPLICATION D_BOOT_COUNT " %d"), Settings->bootcount);
#ifdef USE_DEEPSLEEP
    }
#endif
  }

  if (FirmwareGlobal.power_on_delay) {
    if (1 == Settings->param[P_POWER_ON_DELAY2]) {       // SetOption47 1
      // Allow relay power on once network is available
      if (!FirmwareGlobal.global_state.network_down) {
        FirmwareGlobal.power_on_delay = 0;
      }
    }
    else if (2 == Settings->param[P_POWER_ON_DELAY2]) {  // SetOption47 2
      // Allow relay power on once mqtt is available
      if (!FirmwareGlobal.global_state.mqtt_down) {
        FirmwareGlobal.power_on_delay = 0;
      }
    }
    else {                                               // SetOption47 3..255
      // Allow relay power on after x seconds
      FirmwareGlobal.power_on_delay--;
    }
    if (!FirmwareGlobal.power_on_delay && FirmwareGlobal.power_on_delay_state) {
      // Set relays according to last SetDevicePower() request
      SetDevicePower(FirmwareGlobal.power_on_delay_state, SRC_SO47);
    }
  }

  if (FirmwareGlobal.mqtt_cmnd_blocked_reset) {
    FirmwareGlobal.mqtt_cmnd_blocked_reset--;
    if (!FirmwareGlobal.mqtt_cmnd_blocked_reset) {
      FirmwareGlobal.mqtt_cmnd_blocked = 0;             // Clean up MQTT cmnd loop block
    }
  }

  if (FirmwareGlobal.seriallog_timer) {
    FirmwareGlobal.seriallog_timer--;
    if (!FirmwareGlobal.seriallog_timer) {
      if (FirmwareGlobal.seriallog_level) {
        AddLog(LOG_LEVEL_INFO, PSTR(D_LOG_APPLICATION D_SERIAL_LOGGING_DISABLED));
      }
      FirmwareGlobal.seriallog_level = 0;
    }
  }

  if (FirmwareGlobal.syslog_timer) {  // Restore syslog level
    FirmwareGlobal.syslog_timer--;
    if (!FirmwareGlobal.syslog_timer) {
      FirmwareGlobal.syslog_level = Settings->syslog_level;
      if (Settings->syslog_level) {
        AddLog(LOG_LEVEL_INFO, PSTR(D_LOG_APPLICATION D_SYSLOG_LOGGING_REENABLED));  // Might trigger disable again (on purpose)
      }
    }
  }

  MqttPublishLoggingAsync(false);
  SyslogAsync(false);

  ResetGlobalValues();

  if ((FirmwareGlobal.init_state >= INIT_GPIOS) && PinUsed(GPIO_HEARTBEAT)) {
    digitalWrite(Pin(GPIO_HEARTBEAT), ~FirmwareGlobal.heartbeat_inverted &1);
    delayMicroseconds(50);
    digitalWrite(Pin(GPIO_HEARTBEAT), FirmwareGlobal.heartbeat_inverted);
  }

  // Teleperiod
  if (Settings->tele_period || (3601 == FirmwareGlobal.tele_period)) {
    if (FirmwareGlobal.tele_period >= 9999) {
      if (!FirmwareGlobal.global_state.network_down) {
        FirmwareGlobal.tele_period = 0;  // Allow teleperiod once wifi is connected
      }
    } else {
      FirmwareGlobal.tele_period++;
      if (FirmwareGlobal.tele_period >= Settings->tele_period) {
        FirmwareGlobal.tele_period = 0;

        MqttPublishTeleState();
        MqttPublishTeleperiodSensor();

        XsnsXdrvCall(FUNC_AFTER_TELEPERIOD);
      } else {
        // Global values (Temperature, Humidity and Pressure) update every 10 seconds
        if (!(FirmwareGlobal.tele_period % 10)) {
          for (uint32_t type = 0; type < 3; type++) {
            if (!Settings->global_sensor_index[type] || FirmwareGlobal.user_globals[type]) { continue; }
            GetSensorValues();
            break;
          }
        }
      }
    }
  }

#ifdef ESP8266
  // Wifi keep alive to send Gratuitous ARP
  wifiKeepAlive();
#endif

  WifiPollNtp();

#ifdef ESP32
  if (11 == FirmwareGlobal.uptime) {  // Perform one-time ESP32 houskeeping
    ESP_getSketchSize();             // Init sketchsize as it can take up to 2 seconds
  }
#endif

#ifdef USE_UFILESYS
  static bool settings_lkg = false;  // Settings saved as Last Known Good
  // Copy Settings as Last Known Good if no changes have been saved since 30 minutes
  if (!settings_lkg && (UtcTime() > START_VALID_TIME) && (Settings->cfg_timestamp < UtcTime() - (30 * 60))) {
    TfsSaveFile(TASM_FILE_SETTINGS_LKG, (const uint8_t*)Settings, sizeof(TSettings));
    settings_lkg = true;
  }
#endif
}

/*-------------------------------------------------------------------------------------------*\
 * Every 0.1 second
\*-------------------------------------------------------------------------------------------*/

void Every100mSeconds(void)
{
  // As the max amount of sleep = 250 mSec this loop will shift in time...
  power_t power_now;

  if (FirmwareGlobal.latching_relay_pulse) {
    FirmwareGlobal.latching_relay_pulse--;
    if (!FirmwareGlobal.latching_relay_pulse) {
#ifdef ESP8266
      if (EXS_RELAY == FirmwareGlobal.module_type) {
        SetLatchingRelay(0, 0);
      }
#endif  // ESP8266
    }
  }

