ACU-IOTrotarygarage/ESP32-Firmware/firmware/firmware_support/support_tasmota.ino
  for (uint32_t i = 0; i < MAX_PULSETIMERS; i++) {
    if (FirmwareGlobal.pulse_timer[i] != 0L) {           // Timer active?
      if (TimeReached(FirmwareGlobal.pulse_timer[i])) {  // Timer finished?
        FirmwareGlobal.pulse_timer[i] = 0L;              // Turn off this timer
        for (uint32_t j = 0; (i + j) < FirmwareGlobal.devices_present; j = j +MAX_PULSETIMERS) {
          ExecuteCommandPower(i + j +1, (POWER_ALL_OFF_PULSETIME_ON == Settings->poweronstate) ? POWER_ON : POWER_OFF, SRC_PULSETIMER);
        }
      }
    }
  }

  if (FirmwareGlobal.blink_mask) {
    if (TimeReached(FirmwareGlobal.blink_timer)) {
      SetNextTimeInterval(FirmwareGlobal.blink_timer, 100 * Settings->blinktime);
      FirmwareGlobal.blink_counter--;
      if (!FirmwareGlobal.blink_counter) {
        StopAllPowerBlink();
      } else {
        FirmwareGlobal.blink_power ^= 1;
        power_now = (FirmwareGlobal.power & (POWER_MASK ^ FirmwareGlobal.blink_mask)) | ((FirmwareGlobal.blink_power) ? FirmwareGlobal.blink_mask : 0);
        SetDevicePower(power_now, SRC_IGNORE);
      }
    }
  }
}

/*-------------------------------------------------------------------------------------------*\
 * Every 0.25 second
\*-------------------------------------------------------------------------------------------*/

bool CommandsReady(void) {
  bool ready = BACKLOG_EMPTY ;
#ifdef USE_UFILESYS
  ready |= UfsExecuteCommandFileReady();
#endif  // USE_UFILESYS
  return ready;
}

void Every250mSeconds(void)
{
// As the max amount of sleep = 250 mSec this loop should always be taken...

  static uint8_t blinkspeed = 1;                          // LED blink rate
  uint32_t blinkinterval = 1;

  FirmwareGlobal.state_250mS++;
  FirmwareGlobal.state_250mS &= 0x3;

  FirmwareGlobal.global_state.network_down = (FirmwareGlobal.global_state.wifi_down && FirmwareGlobal.global_state.eth_down) ? 1 : 0;

  if (!Settings->flag.global_state) {                      // SetOption31 - Control link led blinking
    if (FirmwareGlobal.global_state.data &0x03) {                        // Network or MQTT problem
      if (FirmwareGlobal.global_state.mqtt_down) { blinkinterval = 7; }  // MQTT problem so blink every 2 seconds (slowest)
      if (FirmwareGlobal.global_state.network_down) { blinkinterval = 3; }  // Network problem so blink every second (slow)
      FirmwareGlobal.blinks = 201;                         // Allow only a single blink in case the problem is solved
    }
  }
  if (FirmwareGlobal.blinks || FirmwareGlobal.restart_flag || FirmwareGlobal.ota_state_flag) {
    if (FirmwareGlobal.restart_flag || FirmwareGlobal.ota_state_flag) {  // Overrule blinks and keep led lit
      FirmwareGlobal.blinkstate = true;                                  // Stay lit
    } else {
      blinkspeed--;
      if (!blinkspeed) {
        blinkspeed = blinkinterval;                       // Set interval to 0.2 (default), 1 or 2 seconds
        FirmwareGlobal.blinkstate ^= 1;                                  // Blink
      }
    }
    if ((!(Settings->ledstate &0x08)) && ((Settings->ledstate &0x06) || (FirmwareGlobal.blinks > 200) || (FirmwareGlobal.blinkstate))) {
      SetLedLink(FirmwareGlobal.blinkstate);                            // Set led on or off
    }
    if (!FirmwareGlobal.blinkstate) {
      FirmwareGlobal.blinks--;
      if (200 == FirmwareGlobal.blinks) { FirmwareGlobal.blinks = 0; }  // Disable blink
    }
  }
  if (Settings->ledstate &1 && (PinUsed(GPIO_LEDLNK) || !(FirmwareGlobal.blinks || FirmwareGlobal.restart_flag || FirmwareGlobal.ota_state_flag)) ) {
    bool tstate = FirmwareGlobal.power & Settings->ledmask;
#ifdef ESP8266
    if ((SONOFF_TOUCH == FirmwareGlobal.module_type) || (SONOFF_T11 == FirmwareGlobal.module_type) || (SONOFF_T12 == FirmwareGlobal.module_type) || (SONOFF_T13 == FirmwareGlobal.module_type)) {
      tstate = (!FirmwareGlobal.power) ? 1 : 0;           // As requested invert signal for Touch devices to find them in the dark
    }
#endif  // ESP8266
    SetLedPower(tstate);
  }

  // Check if log refresh needed in case of fast buffer fill
  MqttPublishLoggingAsync(true);
  SyslogAsync(true);

/*-------------------------------------------------------------------------------------------*\
 * Every second at 0.25 second interval
\*-------------------------------------------------------------------------------------------*/

  static int ota_result = 0;
  static uint8_t ota_retry_counter = OTA_ATTEMPTS;

  switch (FirmwareGlobal.state_250mS) {
  case 0:                                                 // Every x.0 second
    if (FirmwareGlobal.ota_state_flag && CommandsReady()) {
      FirmwareGlobal.ota_state_flag--;
      if (2 == FirmwareGlobal.ota_state_flag) {
//#ifdef CONFIG_IDF_TARGET_ESP32C3
#ifdef ESP32
        OtaFactoryWrite(false);
#endif
        RtcSettings.ota_loader = 0;                       // Try requested image first
        ota_retry_counter = OTA_ATTEMPTS;
        SettingsSave(1);                                  // Free flash for OTA update
      }
      if (FirmwareGlobal.ota_state_flag <= 0) {
        AllowInterrupts(0);
#ifdef USE_WEBSERVER
//        if (Settings->webserver) StopWebserver();       // 20230107 No more need for disabling webserver during OTA
#endif  // USE_WEBSERVER

        FirmwareGlobal.ota_state_flag = 92;
        ota_result = 0;
        char full_ota_url[200];
        ota_retry_counter--;
        if (ota_retry_counter) {
          char ota_url[TOPSZ];
          strlcpy(full_ota_url, GetOtaUrl(ota_url, sizeof(ota_url)), sizeof(full_ota_url));
#ifdef ESP8266
#ifndef FIRMWARE_MINIMAL
          if (RtcSettings.ota_loader) {
            // OTA File too large so try OTA minimal version
            // Replace Firmware                                         with Firmware-minimal
            // Replace Firmware-DE                                      with Firmware-minimal
            // Replace Firmware.bin                                     with Firmware-minimal.bin
            // Replace Firmware.xyz                                     with Firmware-minimal.xyz
            // Replace Firmware.bin.gz                                  with Firmware-minimal.bin.gz
            // Replace Firmware.xyz.gz                                  with Firmware-minimal.xyz.gz
            // Replace Firmware.ino.bin                                 with Firmware-minimal.ino.bin
            // Replace Firmware.ino.bin.gz                              with Firmware-minimal.ino.bin.gz
            // Replace http://domus1:80/api/arduino/Firmware.bin        with http://domus1:80/api/arduino/Firmware-minimal.bin
            // Replace http://domus1:80/api/arduino/Firmware.bin.gz     with http://domus1:80/api/arduino/Firmware-minimal.bin.gz
            // Replace http://domus1:80/api/arduino/Firmware-DE.bin.gz  with http://domus1:80/api/arduino/Firmware-minimal.bin.gz
            // Replace http://domus1:80/api/ard-uino/Firmware-DE.bin.gz with http://domus1:80/api/ard-uino/Firmware-minimal.bin.gz
            // Replace http://192.168.2.17:80/api/arduino/Firmware.bin  with http://192.168.2.17:80/api/arduino/Firmware-minimal.bin
            // Replace http://192.168.2.17/api/arduino/Firmware.bin.gz  with http://192.168.2.17/api/arduino/Firmware-minimal.bin.gz

            char *bch = strrchr(full_ota_url, '/');         // Only consider filename after last backslash prevent change of urls having "-" in it
            if (bch == nullptr) { bch = full_ota_url; }     // No path found so use filename only
            char *ech = strchr(bch, '.');                              // Find file type in filename (none, .ino.bin, .ino.bin.gz, .bin, .bin.gz or .gz)
            if (ech == nullptr) { ech = full_ota_url + strlen(full_ota_url); }  // Point to '/0' at end of full_ota_url becoming an empty string

//AddLog(LOG_LEVEL_DEBUG, PSTR("OTA: File type [%s]"), ech);

