ACU-IOTrotarygarage/ESP32-Firmware/firmware/firmware_support/support_tasmota.ino
            char ota_url_type[strlen(ech) +1];
            strncpy(ota_url_type, ech, sizeof(ota_url_type));          // Either empty, .ino.bin, .ino.bin.gz, .bin, .bin.gz or .gz

            char *pch = strrchr(bch, '-');                             // Find last dash (-) and ignore remainder - handles Firmware-DE
            if (pch == nullptr) { pch = ech; }                         // No dash so ignore filetype
            *pch = '\0';                                               // full_ota_url = http://domus1:80/api/arduino/Firmware
            snprintf_P(full_ota_url, sizeof(full_ota_url), PSTR("%s-" D_JSON_MINIMAL "%s"), full_ota_url, ota_url_type);  // Minimal filename must be filename-minimal
          }
#endif  // FIRMWARE_MINIMAL
          if (ota_retry_counter < OTA_ATTEMPTS / 2) {
            if (StrCaseStr_P(full_ota_url, PSTR(".gz"))) {
              ota_retry_counter = 1;
            } else {
              strcat_P(full_ota_url, PSTR(".gz"));
            }
          }
#endif  // ESP8266

#ifdef ESP32
#ifndef FIRMWARE_MINIMAL
#ifdef USE_WEBCLIENT_HTTPS
          if (FirmwareGlobal.ota_factory) {
            char *bch = strrchr(full_ota_url, '/');            // Only consider filename after last backslash prevent change of urls having "-" in it
            if (bch == nullptr) { bch = full_ota_url; }        // No path found so use filename only
            char *ech = strchr(bch, '.');                      // Find file type in filename (none, .ino.bin, .ino.bin.gz, .bin, .bin.gz or .gz)
            if (ech == nullptr) { ech = full_ota_url + strlen(full_ota_url); }  // Point to '/0' at end of full_ota_url becoming an empty string
            char ota_url_type[strlen(ech) +1];
            strncpy(ota_url_type, ech, sizeof(ota_url_type));  // Either empty, .ino.bin, .ino.bin.gz, .bin, .bin.gz or .gz

            char *pch = strrchr(bch, '-');                     // Find last dash (-) and ignore remainder - handles Firmware-DE
            if (pch == nullptr) { pch = ech; }                 // No dash so ignore filetype
            *pch = '\0';                                       // full_ota_url = http://domus1:80/api/arduino/Firmware
            snprintf_P(full_ota_url, sizeof(full_ota_url), PSTR("%s-safeboot%s"), full_ota_url, ota_url_type);  // Safeboot filename must be filename-safeboot
          } else
#endif  // USE_WEBCLIENT_HTTPS
          if (EspSingleOtaPartition()) {
//#ifdef CONFIG_IDF_TARGET_ESP32C3
#ifdef ESP32
            OtaFactoryWrite(true);
#endif
            RtcSettings.ota_loader = 1;                 // Try safeboot image next
            SettingsSaveAll();
            AddLog(LOG_LEVEL_INFO, PSTR(D_LOG_APPLICATION D_RESTARTING));
            EspPrepRestartToSafeBoot();
            EspRestart();
          }
#endif  // FIRMWARE_MINIMAL
#endif  // ESP32

          char version[50];
          snprintf_P(version, sizeof(version), PSTR("%s%s"), FirmwareGlobal.version, FirmwareGlobal.image_name);
          AddLog(LOG_LEVEL_DEBUG, PSTR(D_LOG_UPLOAD "%s %s"), full_ota_url, version);
#if defined(ESP32) && defined(USE_WEBCLIENT_HTTPS)
          HTTPClientLight OTAclient;
          if (!OTAclient.begin(full_ota_url)) {
            AddLog(LOG_LEVEL_INFO, "OTA: unsupported protocol");
            ota_result = -999;
          } else {
            httpUpdateLight.rebootOnUpdate(false);
            httpUpdateLight.setFactory(FirmwareGlobal.ota_factory);
            ota_result = (HTTP_UPDATE_FAILED != httpUpdateLight.update(OTAclient, version));
          }
#else // standard OTA over HTTP
          WiFiClient OTAclient;
          ESPhttpUpdate.rebootOnUpdate(false);
          ota_result = (HTTP_UPDATE_FAILED != ESPhttpUpdate.update(OTAclient, full_ota_url, version));
#endif
          if (!ota_result) {
#ifndef FIRMWARE_MINIMAL
            int ota_error = ESPhttpUpdate.getLastError();
            DEBUG_CORE_LOG(PSTR("OTA: Error %d"), ota_error);
#ifdef ESP8266
            if ((HTTP_UE_TOO_LESS_SPACE == ota_error) || (HTTP_UE_BIN_FOR_WRONG_FLASH == ota_error)) {
              RtcSettings.ota_loader = 1;                 // Try minimal image next
            }
#endif  // ESP8266
#endif  // FIRMWARE_MINIMAL
            FirmwareGlobal.ota_state_flag = 2;             // Upgrade failed - retry
          }
        }
      }
      if (90 == FirmwareGlobal.ota_state_flag) {           // Allow MQTT to reconnect
        FirmwareGlobal.ota_state_flag = 0;
        Response_P(PSTR("{\"" D_CMND_UPGRADE "\":\""));
        if (ota_result) {
          ResponseAppend_P(PSTR(D_JSON_SUCCESSFUL ". " D_JSON_RESTARTING));
          FirmwareGlobal.restart_flag = 2;
        } else {
          ResponseAppend_P(PSTR(D_JSON_FAILED " %s"), ESPhttpUpdate.getLastErrorString().c_str());
        }
        ResponseAppend_P(PSTR("\"}"));
//        FirmwareGlobal.restart_flag = 2;                   // Restart anyway to keep memory clean webserver
        MqttPublishPrefixTopicRulesProcess_P(STAT, PSTR(D_CMND_UPGRADE));
        AllowInterrupts(1);
      }
    }
    break;
  case 1:                                                 // Every x.25 second
    if (MidnightNow()) {
      XsnsCall(FUNC_SAVE_AT_MIDNIGHT);
    }

    if (FirmwareGlobal.save_data_counter && CommandsReady()) {
      FirmwareGlobal.save_data_counter--;
      if (FirmwareGlobal.save_data_counter <= 0) {
        if (Settings->flag.save_state) {                   // SetOption0 - Save power state and use after restart
          power_t mask = POWER_MASK;
          for (uint32_t i = 0; i < FirmwareGlobal.devices_present; i++) {
            if ((Settings->pulse_timer[i % MAX_PULSETIMERS] > 0) && (Settings->pulse_timer[i % MAX_PULSETIMERS] < 30)) {  // 3 seconds
              mask &= ~(1 << i);
            }
          }
          if (!((Settings->power &mask) == (FirmwareGlobal.power &mask))) {
            Settings->power = FirmwareGlobal.power;
          }
        } else {
          Settings->power = 0;
        }
        if (!FirmwareGlobal.restart_flag) { SettingsSave(0); }
        FirmwareGlobal.save_data_counter = Settings->save_data;
      }
    }

    if (FirmwareGlobal.restart_flag && CommandsReady()) {
      if ((214 == FirmwareGlobal.restart_flag) ||          // Reset 4
          (215 == FirmwareGlobal.restart_flag) ||          // Reset 5
          (216 == FirmwareGlobal.restart_flag)) {          // Reset 6
        // Backup current SSIDs and Passwords
        char storage_ssid1[strlen(SettingsText(SET_STASSID1)) +1];
        strncpy(storage_ssid1, SettingsText(SET_STASSID1), sizeof(storage_ssid1));
        char storage_ssid2[strlen(SettingsText(SET_STASSID2)) +1];
        strncpy(storage_ssid2, SettingsText(SET_STASSID2), sizeof(storage_ssid2));
        char storage_pass1[strlen(SettingsText(SET_STAPWD1)) +1];
        strncpy(storage_pass1, SettingsText(SET_STAPWD1), sizeof(storage_pass1));
        char storage_pass2[strlen(SettingsText(SET_STAPWD2)) +1];
        strncpy(storage_pass2, SettingsText(SET_STAPWD2), sizeof(storage_pass2));

        char storage_mqtthost[strlen(SettingsText(SET_MQTT_HOST)) +1];
        strncpy(storage_mqtthost, SettingsText(SET_MQTT_HOST), sizeof(storage_mqtthost));
        char storage_mqttuser[strlen(SettingsText(SET_MQTT_USER)) +1];
        strncpy(storage_mqttuser, SettingsText(SET_MQTT_USER), sizeof(storage_mqttuser));
        char storage_mqttpwd[strlen(SettingsText(SET_MQTT_PWD)) +1];
        strncpy(storage_mqttpwd, SettingsText(SET_MQTT_PWD), sizeof(storage_mqttpwd));
        char storage_mqtttopic[strlen(SettingsText(SET_MQTT_TOPIC)) +1];
        strncpy(storage_mqtttopic, SettingsText(SET_MQTT_TOPIC), sizeof(storage_mqtttopic));
        uint16_t mqtt_port = Settings->mqtt_port;

