ACU-IOTrotarygarage/ESP32-Firmware/firmware/firmware_support/support_tasmota.ino
//        if (216 == FirmwareGlobal.restart_flag) {
          // Backup mqtt host, port, client, username and password
//        }
        if ((215 == FirmwareGlobal.restart_flag) ||        // Reset 5
            (216 == FirmwareGlobal.restart_flag)) {        // Reset 6
          SettingsErase(2);  // Erase all flash from program end to end of physical excluding optional filesystem
        }
        SettingsDefault();
        // Restore current SSIDs and Passwords
        SettingsUpdateText(SET_STASSID1, storage_ssid1);
        SettingsUpdateText(SET_STASSID2, storage_ssid2);
        SettingsUpdateText(SET_STAPWD1, storage_pass1);
        SettingsUpdateText(SET_STAPWD2, storage_pass2);
        if (216 == FirmwareGlobal.restart_flag) {          // Reset 6
          // Restore the mqtt host, port, client, username and password
          SettingsUpdateText(SET_MQTT_HOST, storage_mqtthost);
          SettingsUpdateText(SET_MQTT_USER, storage_mqttuser);
          SettingsUpdateText(SET_MQTT_PWD, storage_mqttpwd);
          SettingsUpdateText(SET_MQTT_TOPIC, storage_mqtttopic);
          Settings->mqtt_port = mqtt_port;
        }

        XdrvCall(FUNC_RESET_SETTINGS);

        FirmwareGlobal.restart_flag = 3;                   // Finish backlog then Restart 1
      }
      else if (213 == FirmwareGlobal.restart_flag) {       // Reset 3
        SettingsSdkErase();  // Erase flash SDK parameters
        FirmwareGlobal.restart_flag = 2;                   // Restart 1
      }
      else if (212 == FirmwareGlobal.restart_flag) {       // Reset 2
        SettingsErase(0);    // Erase all flash from program end to end of physical flash
        FirmwareGlobal.restart_flag = 211;                 // Reset 1
      }

      if (211 == FirmwareGlobal.restart_flag) {            // Reset 1
        SettingsDefault();
        FirmwareGlobal.restart_flag = 3;                   // Finish backlog then Restart 1
      }

      if (2 == FirmwareGlobal.restart_flag) {              // Restart 1
        SettingsSaveAll();
      }

      FirmwareGlobal.restart_flag--;
      if (FirmwareGlobal.restart_flag <= 0) {
        AddLog(LOG_LEVEL_INFO, PSTR(D_LOG_APPLICATION "%s"), (FirmwareGlobal.restart_halt) ? PSTR("Halted") : PSTR(D_RESTARTING));
        EspRestart();
      }
    }
    break;
  case 2:                                                 // Every x.5 second
    if (Settings->flag4.network_wifi) {
      WifiCheck(FirmwareGlobal.wifi_state_flag);
      FirmwareGlobal.wifi_state_flag = WIFI_RESTART;
    } else {
      WifiDisable();
    }
    break;
  case 3:
    {
      if (!FirmwareGlobal.global_state.network_down) {
#ifdef FIRMWARE_MINIMAL
//#ifdef CONFIG_IDF_TARGET_ESP32C3
#ifdef ESP32
        if (OtaFactoryRead()) {
          OtaFactoryWrite(false);
          FirmwareGlobal.ota_state_flag = 3;
          AddLog(LOG_LEVEL_DEBUG, PSTR("OTA: Propagating upload"));
        }
#endif
        if (1 == RtcSettings.ota_loader) {
          RtcSettings.ota_loader = 0;
          FirmwareGlobal.ota_state_flag = 3;
        }
#endif  // FIRMWARE_MINIMAL

#ifdef USE_DISCOVERY
        StartMdns();
#endif  // USE_DISCOVERY

#ifdef USE_WEBSERVER
        if (Settings->webserver) {

#ifdef ESP8266
          if (!WifiIsInManagerMode()) { StartWebserver(Settings->webserver); }
#endif  // ESP8266
#ifdef ESP32
          StartWebserver(Settings->webserver);
#endif  // ESP32

#ifdef USE_DISCOVERY
#ifdef WEBSERVER_ADVERTISE
          MdnsAddServiceHttp();
#endif  // WEBSERVER_ADVERTISE
#endif  // USE_DISCOVERY

        } else {
          StopWebserver();
        }
#endif  // USE_WEBSERVER

#ifdef USE_DEVICE_GROUPS
        DeviceGroupsStart();
#endif  // USE_DEVICE_GROUPS

        // send FUNC_NETWORK_UP to all modules
//        AddLog(LOG_LEVEL_DEBUG_MORE, PSTR("WIF: Sending FUNC_NETWORK_UP"));
        XdrvXsnsCall(FUNC_NETWORK_UP);

        MqttCheck();
      } else {

#ifdef USE_DEVICE_GROUPS
        DeviceGroupsStop();
#endif  // USE_DEVICE_GROUPS

        // send FUNC_NETWORK_DOWN to all modules
//        AddLog(LOG_LEVEL_DEBUG_MORE, PSTR("WIF: Sending FUNC_NETWORK_DOWN"));
        XdrvXsnsCall(FUNC_NETWORK_DOWN);
      }                                           // Every x.75 second
    }
    break;
  }
}

#ifdef USE_ARDUINO_OTA
/*********************************************************************************************\
 * Allow updating via the Arduino OTA-protocol.
 *
 * - Once started disables current wifi clients and udp
 * - Perform restart when done to re-init wifi clients
\*********************************************************************************************/

bool arduino_ota_triggered = false;
uint16_t arduino_ota_progress_dot_count = 0;

void ArduinoOTAInit(void)
{
  ArduinoOTA.setPort(8266);
  ArduinoOTA.setHostname(NetworkHostname());
  if (strlen(SettingsText(SET_WEBPWD))) {
    ArduinoOTA.setPassword(SettingsText(SET_WEBPWD));
  }

  ArduinoOTA.onStart([]()
  {
    SettingsSave(1);         // Free flash for OTA update
#ifdef USE_WEBSERVER
    if (Settings->webserver) { StopWebserver(); }
#endif  // USE_WEBSERVER
    AllowInterrupts(0);
    if (Settings->flag.mqtt_enabled) {
      MqttDisconnect();      // SetOption3  - Enable MQTT
    }
    AddLog(LOG_LEVEL_INFO, PSTR(D_LOG_UPLOAD "Arduino OTA " D_UPLOAD_STARTED));
    arduino_ota_triggered = true;
    arduino_ota_progress_dot_count = 0;
    delay(100);              // Allow time for message xfer
  });

  ArduinoOTA.onProgress([](unsigned int progress, unsigned int total)
  {
    if ((LOG_LEVEL_DEBUG <= FirmwareGlobal.seriallog_level)) {
      arduino_ota_progress_dot_count++;
      TasConsole.printf(".");
      if (!(arduino_ota_progress_dot_count % 80)) { TasConsole.println(); }
    }
  });

  ArduinoOTA.onError([](ota_error_t error)
  {
    /*
    From ArduinoOTA.h:
    typedef enum { OTA_AUTH_ERROR, OTA_BEGIN_ERROR, OTA_CONNECT_ERROR, OTA_RECEIVE_ERROR, OTA_END_ERROR } ota_error_t;
    */
    char error_str[100];

    if ((LOG_LEVEL_DEBUG <= FirmwareGlobal.seriallog_level) && arduino_ota_progress_dot_count) { TasConsole.println(); }
    switch (error) {
      case OTA_BEGIN_ERROR: strncpy_P(error_str, PSTR(D_UPLOAD_ERR_2), sizeof(error_str)); break;
      case OTA_RECEIVE_ERROR: strncpy_P(error_str, PSTR(D_UPLOAD_ERR_5), sizeof(error_str)); break;
      case OTA_END_ERROR: strncpy_P(error_str, PSTR(D_UPLOAD_ERR_7), sizeof(error_str)); break;
      default:
        snprintf_P(error_str, sizeof(error_str), PSTR(D_UPLOAD_ERROR_CODE " %d"), error);
    }
    AddLog(LOG_LEVEL_INFO, PSTR(D_LOG_UPLOAD "Arduino OTA  %s. " D_RESTARTING), error_str);
    EspRestart();
  });

  ArduinoOTA.onEnd([]()
  {
    if ((LOG_LEVEL_DEBUG <= FirmwareGlobal.seriallog_level)) { TasConsole.println(); }
    AddLog(LOG_LEVEL_INFO, PSTR(D_LOG_UPLOAD "Arduino OTA " D_SUCCESSFUL ". " D_RESTARTING));
    EspRestart();
	});

  ArduinoOTA.begin();
  AddLog(LOG_LEVEL_INFO, PSTR(D_LOG_UPLOAD "Arduino OTA " D_ENABLED " " D_PORT " 8266"));
}

void ArduinoOtaLoop(void)
{
  MDNS.update();
  ArduinoOTA.handle();
  // Once OTA is triggered, only handle that and dont do other stuff. (otherwise it fails)
  while (arduino_ota_triggered) { ArduinoOTA.handle(); }
}
#endif  // USE_ARDUINO_OTA

