ACU-IOTrotarygarage/ESP32-Firmware/firmware/firmware_support/support_tasmota.ino
/********************************************************************************************/

void SerialInput(void)
{
  static uint32_t serial_polling_window = 0;
  static bool serial_buffer_overrun = false;

  while (Serial.available()) {
//    yield();
    delay(0);
    FirmwareGlobal.serial_in_byte = Serial.read();

    if (0 == FirmwareGlobal.serial_in_byte_counter) {
      serial_buffer_overrun = false;
    }
    else if ((FirmwareGlobal.serial_in_byte_counter == INPUT_BUFFER_SIZE)
#ifdef ESP8266
             || Serial.hasOverrun()
#endif
                                                             ) {
      serial_buffer_overrun = true;
    }

#ifdef ESP8266
/*-------------------------------------------------------------------------------------------*\
 * Sonoff dual and ch4 19200 baud serial interface
\*-------------------------------------------------------------------------------------------*/
    if ((SONOFF_DUAL == FirmwareGlobal.module_type) || (CH4 == FirmwareGlobal.module_type)) {
      FirmwareGlobal.serial_in_byte = ButtonSerial(FirmwareGlobal.serial_in_byte);
    }
#endif  // ESP8266
/*-------------------------------------------------------------------------------------------*/

    if (XdrvCall(FUNC_SERIAL)) {
      FirmwareGlobal.serial_in_byte_counter = 0;
      Serial.flush();
      return;
    }

/*-------------------------------------------------------------------------------------------*/

    if (FirmwareGlobal.serial_in_byte > 127 && !Settings->flag.mqtt_serial_raw) {   // Discard binary data above 127 if no raw reception allowed - CMND_SERIALSEND3
      FirmwareGlobal.serial_in_byte_counter = 0;
      Serial.flush();
      return;
    }
    if (!Settings->flag.mqtt_serial) {                                             // SerialSend active - CMND_SERIALSEND and CMND_SERIALLOG
      if (isprint(FirmwareGlobal.serial_in_byte)) {                                 // Any char between 32 and 127
        if (FirmwareGlobal.serial_in_byte_counter < INPUT_BUFFER_SIZE -1) {         // Add char to string if it still fits
          FirmwareGlobal.serial_in_buffer[FirmwareGlobal.serial_in_byte_counter++] = FirmwareGlobal.serial_in_byte;
        } else {
          serial_buffer_overrun = true;                                            // Signal overrun but continue reading input to flush until '\n' (EOL)
        }
      }
    } else {
      if (FirmwareGlobal.serial_in_byte || Settings->flag.mqtt_serial_raw) {        // Any char between 1 and 127 or any char (0 - 255) - CMND_SERIALSEND3
        bool in_byte_is_delimiter =                                                // Char is delimiter when...
          (((Settings->serial_delimiter < 128) && (FirmwareGlobal.serial_in_byte == Settings->serial_delimiter)) || // Any char between 1 and 127 and being delimiter
          ((Settings->serial_delimiter == 128) && !isprint(FirmwareGlobal.serial_in_byte))) &&   // Any char not between 32 and 127
          !Settings->flag.mqtt_serial_raw;                                         // In raw mode (CMND_SERIALSEND3) there is never a delimiter

        if ((FirmwareGlobal.serial_in_byte_counter < INPUT_BUFFER_SIZE -1) &&       // Add char to string if it still fits and ...
            !in_byte_is_delimiter) {                                               // Char is not a delimiter
          FirmwareGlobal.serial_in_buffer[FirmwareGlobal.serial_in_byte_counter++] = FirmwareGlobal.serial_in_byte;
        }

        if ((FirmwareGlobal.serial_in_byte_counter >= INPUT_BUFFER_SIZE -1) ||      // Send message when buffer is full or ...
            in_byte_is_delimiter) {                                                // Char is delimiter
          serial_polling_window = 0;                                               // Reception done - send mqtt
          break;
        }

        serial_polling_window = millis();                                          // Wait for next char
      }
    }

#ifdef USE_SONOFF_SC
/*-------------------------------------------------------------------------------------------*\
 * Sonoff SC 19200 baud serial interface
\*-------------------------------------------------------------------------------------------*/
    if (SONOFF_SC == FirmwareGlobal.module_type) {
      if (FirmwareGlobal.serial_in_byte == '\x1B') {                                // Sonoff SC status from ATMEGA328P
        FirmwareGlobal.serial_in_buffer[FirmwareGlobal.serial_in_byte_counter] = 0;  // Serial data completed
        SonoffScSerialInput(FirmwareGlobal.serial_in_buffer);
        FirmwareGlobal.serial_in_byte_counter = 0;
        Serial.flush();
        return;
      }
    } else
#endif  // USE_SONOFF_SC
/*-------------------------------------------------------------------------------------------*/

#ifdef ESP32
    if (tasconsole_serial) {
#endif  // ESP32

    if (!Settings->flag.mqtt_serial && (FirmwareGlobal.serial_in_byte == '\n')) {   // CMND_SERIALSEND and CMND_SERIALLOG
      FirmwareGlobal.serial_in_buffer[FirmwareGlobal.serial_in_byte_counter] = 0;    // Serial data completed
      FirmwareGlobal.seriallog_level = (Settings->seriallog_level < LOG_LEVEL_INFO) ? (uint8_t)LOG_LEVEL_INFO : Settings->seriallog_level;
      if (serial_buffer_overrun) {
        AddLog(LOG_LEVEL_INFO, PSTR(D_LOG_COMMAND "Serial buffer overrun"));
      } else {
        AddLog(LOG_LEVEL_INFO, PSTR(D_LOG_COMMAND "%s"), FirmwareGlobal.serial_in_buffer);
        ExecuteCommand(FirmwareGlobal.serial_in_buffer, SRC_SERIAL);
      }
      FirmwareGlobal.serial_in_byte_counter = 0;
      serial_polling_window = 0;
      Serial.flush();
      return;
    }

#ifdef ESP32
    }
#endif  // ESP32

  }  // endWhile

  if (Settings->flag.mqtt_serial && FirmwareGlobal.serial_in_byte_counter && (millis() > (serial_polling_window + SERIAL_POLLING))) {  // CMND_SERIALSEND and CMND_SERIALLOG
    FirmwareGlobal.serial_in_buffer[FirmwareGlobal.serial_in_byte_counter] = 0;      // Serial data completed
    bool assume_json = (!Settings->flag.mqtt_serial_raw && (FirmwareGlobal.serial_in_buffer[0] == '{'));

