ACU-IOTrotarygarage/ESP32-Firmware/firmware/firmware_support/support_tasmota.ino
//  AddLog(LOG_LEVEL_DEBUG, PSTR("DBG: FirmwareGlobal.gpio_pin %*_V"), nitems(FirmwareGlobal.gpio_pin), (uint8_t*)FirmwareGlobal.gpio_pin);

  if (ResetReasonPowerOn()) {
    FirmwareGlobal.power_on_delay = Settings->param[P_POWER_ON_DELAY2];  // SetOption47 - Delay switching relays to reduce power surge at power on
    if (FirmwareGlobal.power_on_delay) {
      // This is the earliest possibility to disable relays connected to esp8266/esp32 gpios at power up to reduce power surge
      for (uint32_t i = 0; i < MAX_RELAYS; i++) {
        if (PinUsed(GPIO_REL1, i)) {
          DigitalWrite(GPIO_REL1, i, bitRead(FirmwareGlobal.rel_inverted, i) ? 1 : 0);  // Off
        }
      }
      AddLog(LOG_LEVEL_DEBUG, PSTR("INI: SO47 %d Power off relays"), Settings->param[P_POWER_ON_DELAY2]);
    }
  }

  analogWriteRange(Settings->pwm_range);      // Default is 1023 (Arduino.h)
  analogWriteFreq(Settings->pwm_frequency);   // Default is 1000 (core_esp8266_wiring_pwm.c)

#ifdef ESP8266
  if ((2 == Pin(GPIO_TXD)) || (H801 == FirmwareGlobal.module_type)) { Serial.set_tx(2); }
  SetSerialSwap();
#endif

  uint32_t sspi_mosi = (PinUsed(GPIO_SSPI_SCLK) && PinUsed(GPIO_SSPI_MOSI)) ? SPI_MOSI : SPI_NONE;
  uint32_t sspi_miso = (PinUsed(GPIO_SSPI_SCLK) && PinUsed(GPIO_SSPI_MISO)) ? SPI_MISO : SPI_NONE;
  FirmwareGlobal.soft_spi_enabled = sspi_mosi + sspi_miso;
  AddLogSpi(0, Pin(GPIO_SSPI_SCLK), Pin(GPIO_SSPI_MOSI), Pin(GPIO_SSPI_MISO));

#ifdef USE_SPI
#ifdef ESP8266
  if (!FirmwareGlobal.soft_spi_enabled) {
    bool valid_cs = (ValidSpiPinUsed(GPIO_SPI_CS) ||
                     ValidSpiPinUsed(GPIO_RC522_CS) ||
                     (ValidSpiPinUsed(GPIO_NRF24_CS) && ValidSpiPinUsed(GPIO_NRF24_DC)) ||
                     ValidSpiPinUsed(GPIO_ILI9341_CS) ||
                     ValidSpiPinUsed(GPIO_ILI9341_DC) || // there are also boards without cs
                     ValidSpiPinUsed(GPIO_EPAPER29_CS) ||
                     ValidSpiPinUsed(GPIO_EPAPER42_CS) ||
                     ValidSpiPinUsed(GPIO_ILI9488_CS) ||
                     ValidSpiPinUsed(GPIO_SSD1351_CS) ||
                     ValidSpiPinUsed(GPIO_RA8876_CS) ||
                     ValidSpiPinUsed(GPIO_ST7789_DC) ||  // ST7789 CS may be omitted so chk DC too
                     ValidSpiPinUsed(GPIO_ST7789_CS) ||
                     (ValidSpiPinUsed(GPIO_SSD1331_CS) && ValidSpiPinUsed(GPIO_SSD1331_DC)) ||
                     ValidSpiPinUsed(GPIO_SDCARD_CS) ||
                     ValidSpiPinUsed(GPIO_MCP2515_CS)
                    );
    // If SPI_CS and/or SPI_DC is used they must be valid
    FirmwareGlobal.spi_enabled = (valid_cs) ? SPI_MOSI_MISO : SPI_NONE;
    if (FirmwareGlobal.spi_enabled) {
      FirmwareGlobal.my_module.io[12] = AGPIO(GPIO_SPI_MISO);
      SetPin(12, AGPIO(GPIO_SPI_MISO));
      FirmwareGlobal.my_module.io[13] = AGPIO(GPIO_SPI_MOSI);
      SetPin(13, AGPIO(GPIO_SPI_MOSI));
      FirmwareGlobal.my_module.io[14] = AGPIO(GPIO_SPI_CLK);
      SetPin(14, AGPIO(GPIO_SPI_CLK));
    }
  }
#endif  // ESP8266
#ifdef ESP32
/*
  if (PinUsed(GPIO_SPI_CS) ||
      PinUsed(GPIO_RC522_CS) ||
      PinUsed(GPIO_NRF24_CS) ||
      PinUsed(GPIO_ILI9341_CS) ||
      PinUsed(GPIO_EPAPER29_CS) ||
      PinUsed(GPIO_EPAPER42_CS) ||
      PinUsed(GPIO_ILI9488_CS) ||
      PinUsed(GPIO_SSD1351_CS) ||
      PinUsed(GPIO_RA8876_CS) ||
      PinUsed(GPIO_ST7789_DC) ||  // ST7789 CS may be omitted so chk DC too
      PinUsed(GPIO_ST7789_CS) ||
      PinUsed(GPIO_SSD1331_CS) ||
      PinUsed(GPIO_SDCARD_CS)
     ) {
    uint32_t spi_mosi = (PinUsed(GPIO_SPI_CLK) && PinUsed(GPIO_SPI_MOSI)) ? SPI_MOSI : SPI_NONE;
    uint32_t spi_miso = (PinUsed(GPIO_SPI_CLK) && PinUsed(GPIO_SPI_MISO)) ? SPI_MISO : SPI_NONE;
    FirmwareGlobal.spi_enabled = spi_mosi + spi_miso;
  }
*/
  uint32_t spi_mosi = (PinUsed(GPIO_SPI_CLK) && PinUsed(GPIO_SPI_MOSI)) ? SPI_MOSI : SPI_NONE;
  uint32_t spi_miso = (PinUsed(GPIO_SPI_CLK) && PinUsed(GPIO_SPI_MISO)) ? SPI_MISO : SPI_NONE;
  FirmwareGlobal.spi_enabled = spi_mosi + spi_miso;
#endif  // ESP32
  AddLogSpi(1, Pin(GPIO_SPI_CLK), Pin(GPIO_SPI_MOSI), Pin(GPIO_SPI_MISO));
#endif  // USE_SPI

  for (uint32_t i = 0; i < nitems(FirmwareGlobal.my_module.io); i++) {
    uint32_t mpin = ValidPin(i, FirmwareGlobal.my_module.io[i]);
//    AddLog(LOG_LEVEL_DEBUG, PSTR("INI: gpio pin %d, mpin %d"), i, mpin);
    if (AGPIO(GPIO_OUTPUT_HI) == mpin) {
      pinMode(i, OUTPUT);
      digitalWrite(i, 1);
    }
    else if (AGPIO(GPIO_OUTPUT_LO) == mpin) {
      pinMode(i, OUTPUT);
      digitalWrite(i, 0);
    }

/*
  // Until 20210726

    // Set any non-used GPIO to INPUT - Related to resetPins() in support_legacy_cores.ino
    // Doing it here solves relay toggles at restart.
#if CONFIG_IDF_TARGET_ESP32C3
    else if (((i < 11) || (i > 17)) && (GPIO_NONE == mpin)) {  // Skip SPI flash interface
      if (!((20 == i) || (21 == i))) {             // Skip serial
        pinMode(i, INPUT);
      }
    }
#else // CONFIG_IDF_TARGET_ESP32C3
    else if (((i < 6) || (i > 11)) && (GPIO_NONE == mpin)) {  // Skip SPI flash interface
      if (!((1 == i) || (3 == i))) {             // Skip serial
        pinMode(i, INPUT);
      }
    }
#endif // CONFIG_IDF_TARGET_ESP32C3
*/
#ifdef ESP8266
    // Set any non-used GPIO to INPUT - Related to resetPins() in support_legacy_cores.ino
    // Doing it here solves relay toggles at restart.
    else if (((i < 6) || (i > 11)) && (GPIO_NONE == mpin)) {  // Skip SPI flash interface
      if (!((1 == i) || (3 == i))) {             // Skip serial
        pinMode(i, INPUT);
      }
    }
#endif  // ESP8266
  }

  DigitalWrite(GPIO_HEARTBEAT, 0, FirmwareGlobal.heartbeat_inverted);

  // Digital input
  for (uint32_t i = 0; i < MAX_SWITCHES; i++) {
    if (PinUsed(GPIO_INPUT, i)) {
      pinMode(Pin(GPIO_INPUT, i), INPUT);
    }
  }

  if (Settings->param[P_POWER_ON_DELAY]) {                 // SetOption46 - Allow Wemos D1 power to stabilize before starting I2C polling for devices powered locally
    uint32_t init_delay = Settings->param[P_POWER_ON_DELAY] * 10;
    AddLog(LOG_LEVEL_DEBUG, PSTR("INI: SO46 Wait %d msec"), init_delay);
    delay(init_delay);
  }

