ACU-IOTrotarygarage/ESP32-Firmware/firmware/firmware_support/support_tasmota.ino
#ifdef USE_I2C
  FirmwareGlobal.i2c_enabled = (PinUsed(GPIO_I2C_SCL) && PinUsed(GPIO_I2C_SDA));
  if (FirmwareGlobal.i2c_enabled) {
    FirmwareGlobal.i2c_enabled = I2cBegin(Pin(GPIO_I2C_SDA), Pin(GPIO_I2C_SCL));
  }
#ifdef ESP32
  FirmwareGlobal.i2c_enabled_2 = (PinUsed(GPIO_I2C_SCL, 1) && PinUsed(GPIO_I2C_SDA, 1));
  if (FirmwareGlobal.i2c_enabled_2) {
    FirmwareGlobal.i2c_enabled_2 = I2c2Begin(Pin(GPIO_I2C_SDA, 1), Pin(GPIO_I2C_SCL, 1));
  }
#endif
#endif  // USE_I2C

  FirmwareGlobal.devices_present = 0;
  uint32_t bi_device = 0;
  for (uint32_t i = 0; i < MAX_RELAYS; i++) {
    if (PinUsed(GPIO_REL1, i)) {
      FirmwareGlobal.devices_present++;
#ifdef ESP8266
      if (EXS_RELAY == FirmwareGlobal.module_type) {
        if (i &1) { FirmwareGlobal.devices_present--; }
      }
#endif  // ESP8266
      if (bitRead(FirmwareGlobal.rel_bistable, i)) {
        if (bi_device &1) { FirmwareGlobal.devices_present--; }
        bi_device++;
      }
    }
  }

  XdrvCall(FUNC_SETUP_RING1);                              // Setup RTC hardware
  XsnsXdrvCall(FUNC_SETUP_RING2);                          // Setup hardware supporting virtual switches/buttons/relays

  FirmwareGlobal.light_type = LT_BASIC;                     // Use basic PWM control if SetOption15 = 0

  if (XdrvCall(FUNC_MODULE_INIT)) {                        // Init and claim single module (like tuya, armtronix, ifan, light)
    // Serviced
  }
#ifdef ESP8266
  else if (YTF_IR_BRIDGE == FirmwareGlobal.module_type) {
    ClaimSerial();  // Stop serial loopback mode
  }
  else if (SONOFF_DUAL == FirmwareGlobal.module_type) {
    UpdateDevicesPresent(2);
    SetSerial(19200, TS_SERIAL_8N1);
  }
  else if (CH4 == FirmwareGlobal.module_type) {
    UpdateDevicesPresent(4);
    SetSerial(19200, TS_SERIAL_8N1);
  }
#endif  // ESP8266

  GpioInitPwm();

  for (uint32_t i = 0; i < MAX_LEDS; i++) {
    if (PinUsed(GPIO_LED1, i)) {
#ifdef USE_ARILUX_RF
      if ((3 == i) && (FirmwareGlobal.leds_present < 2) && !PinUsed(GPIO_ARIRFSEL)) {
        SetPin(Pin(GPIO_LED1, i), AGPIO(GPIO_ARIRFSEL));  // Legacy support where LED4 was Arilux RF enable
      } else {
#endif
        FirmwareGlobal.leds_present++;
        DigitalWrite(GPIO_LED1, i, bitRead(FirmwareGlobal.led_inverted, i));
#ifdef USE_ARILUX_RF
      }
#endif
    }
  }
  DigitalWrite(GPIO_LEDLNK, 0, FirmwareGlobal.ledlnk_inverted);

#ifdef USE_PWM_DIMMER
  if (PWM_DIMMER == FirmwareGlobal.module_type && PinUsed(GPIO_REL1)) { FirmwareGlobal.devices_present--; }
#endif  // USE_PWM_DIMMER

  SetLedPower(Settings->ledstate &8);
  SetLedLink(Settings->ledstate &8);
}
